Repository: 84000/data-translation-memory
Catalog: toh65-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ག་ལ་བ་དེར་སོང་སྟེ། དེ་ཉིད་ཀྱི་ནུབ་མོ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་ཕྱོགས་གང་ན་གྲོང་ཁྱེར་ཐམས་ཅད་ཀྱི་བཙོག་དགུ་དང་། མི་འཐུན་པ་ཐམས་ཅད་འབབ་པ་དང་། འབྱུང་བའི་ས་ཕྱོགས་དེར་འཁོར་གྱི་ཁྱམས་ཆེན་པོ་དར་གྱི་ལྡ་ལྡི་དང་།
en: Then Bhadra the illusionist went to the great city of Rājagṛha, and that very night, in the sector of the great city of Rājagṛha where all the city’s refuse and unclean things were discarded, he conjured up a great reception courtyard adorned with silken streamers, parasols, victory banners, and raised silk flags.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བས་བརྒྱན་པ། གཞི་ལག་མཐིལ་ལྟར་མཉམ་པ། མེ་ཏོག་བཀྲམ་པ།
en: He conjured the ground so that it was as even as the palm of a hand, strewn with flowers, fragrant with excellent incense, and adorned with a canopy above.

source: སྤོས་བཟང་པོ་མཆོག་གིས་བདུགས་པ། སྟེང་དུ་བླ་རེ་བྲེས་པ་ཞིག་མངོན་པར་སྤྲུལ་ཏོ། །འཁོར་གྱི་ཁྱམས་དེའི་ནང་དུ་ཡང་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་མེ་ཏོག་དང་འབྲས་བུར་བཅས་པ་བརྒྱད་སྟོང་མངོན་པར་སྤྲུལ་ཏོ། །
en: Within that courtyard, he also conjured eight thousand exquisite trees replete with flowers and fruits.

source: རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་ཐམས་ཅད་ཀྱི་དྲུང་དུ་ཡང་སེང་གེའི་ཁྲི་རས་བཅོས་བུ་དུ་མས་གཡོགས་པ་རིན་པོ་ཆེའི་བ་དན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་མངོན་པར་སྤྲུལ་ཏོ། །
en: In front of all the exquisite trees he conjured lion thrones covered with many kinds of cotton cloth and adorned with all kinds of precious silk flags.

source: སེང་གེའི་ཁྲིའི་གཡས་གཡོན་དུ་ཡང་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་མེ་ཏོག་དང་འབྲས་བུར་བཅས་པ་བཞི་བཞི་མངོན་པར་སྤྲུལ་ཏོ། །
en: He conjured four exquisite trees replete with flowers and fruits to both the left and right of each lion throne.

source: བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཡོངས་སུ་ལོངས་སྤྱད་པར་བྱ་བའི་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པ་ཡང་མངོན་པར་སྤྲུལ་ཏོ། །
en: He conjured fine dishes endowed with a hundred flavors for the Blessed One and the saṅgha of monks to enjoy.

source: རིམ་གྲོ་བྱེད་པ་གོས་དཀར་པོ་བགོས་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ལྔ་བརྒྱ་ཡང་མངོན་པར་སྤྲུལ་ཏོ། །
en: He also conjured five hundred attendants, all dressed in white and bedecked with all kinds of accoutrements.

source: སྒྱུ་མ་མཁན་བཟང་པོས་བཀོད་པ་དེ་ལྟ་བུ་སྤྲུལ་མ་ཐག་ཏུ་དེ་ནས་དེའི་མོད་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལུས་ཆེན་པོར་སྤྲུལ་ནས་སྒྱུ་མ་མཁན་བཟང་པོའི་འཁོར་གྱི་ཁྱམས་ཀྱི་བཀོད་པ་ག་ལ་བ་དེར་སོང་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཟང་པོ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སང་གདུགས་ཚོད་ལ་སྤྱན་དྲངས་པ་དང་།
en: As soon as Bhadra the illusionist had conjured up this banquet, the Four Great Kings, emanating as large bodies, came instantaneously to the illusionist Bhadra’s courtyard array and said to him, “Bhadra, you have invited the Tathāgata for tomorrow’s midday meal, and you have conjured such a courtyard for the Tathāgata to enjoy.

source: ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་ལོངས་སྤྱད་པར་བྱ་བའི་འཁོར་གྱི་ཁྱམས་ཀྱི་བཀོད་པ་འདི་ལྟ་བུ་འདི་མངོན་པར་སྤྲུལ་པ་ནི་རྙེད་པ་ལེགས་པར་རྙེད་དོ། །
en: You have done very well!

source: བཟང་པོ་གཞན་ཡང་ཁོ་བོ་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བའི་ལས་བྱ་བ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཡོངས་སུ་ལོངས་སྤྱད་པ་དང་། ཁྱོད་ལ་བསྟང་བའི་ཕྱིར་འཁོར་གྱི་ཁྱམས་ཀྱི་བཀོད་པ་འདི་ལྟ་བུ་གཉིས་པ་ཅུང་ཞིག་སྟོན་པར་བྱེད་ན་ཁོ་བོ་ཅག་ལ་གནང་བར་གྱིས་ཤིག །
en: “Bhadra, please grant us permission to also make offerings to the Tathāgata, by displaying a second modest courtyard like this for the Blessed One to enjoy, to accompany yours!”

source: དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་ཤིན་ཏུ་ངོ་མཚར་དུ་གྱུར་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་གནང་བ་དང་། དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡོངས་སུ་ལོངས་སྤྱད་པར་བྱ་བའི་འཁོར་གྱི་ཁྱམས་དེ་ལྟ་བུ་ཞིག་མངོན་པར་སྤྲུལ་ཏོ། །
en: Bhadra the illusionist was utterly amazed and granted permission to the Four Great Kings, who then conjured a similar courtyard array for the Blessed One to enjoy.

source: དེ་ནས་ཡང་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལྷའི་བུ་སུམ་ཁྲི་དང་ལྷན་ཅིག་བཟང་པོའི་འཁོར་གྱི་ཁྱམས་ཀྱི་བཀོད་པ་ག་ལ་བ་དེར་སོང་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཟང་པོ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པས་ང་གདུགས་ཚོད་ལ་སྤྱན་དྲངས་པ་དང་།
en: Then Śakra, ruler of the gods, arrived together with thirty thousand gods at Bhadra’s courtyard array and said to him, “Bhadra, you have invited the Tathāgata for tomorrow’s midday meal, and you have conjured such a courtyard array for the Tathāgata to enjoy.

source: དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་ལོངས་སྤྱད་པར་བྱ་བའི་འཁོར་གྱི་ཁྱམས་ཀྱི་བཀོད་པ་འདི་ལྟ་བུ་འདི་མངོན་པར་སྤྲུལ་པ་ནི་རྙེད་པ་ལེགས་པར་རྙེད་དོ། །
en: You have done well!

source: བཟང་པོ་ཁོ་བོ་ཅག་ཀྱང་། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་བྱ་ཞིང་བཅོམ་ལྡན་འདས་ཀྱིས་ཡོངས་སུ་ལོངས་སྤྱད་པ་དང་། ཁྱོད་ལ་བསྟང་བའི་ཕྱིར་འཁོར་གྱི་ཁྱམས་ཀྱི་བཀོད་པ་འདི་ལྟ་བུ་གཉིས་པ་ཅུང་ཞིག་སྟོན་པར་བྱེད་ན་ཁོ་བོ་ཅག་ལ་གནང་བར་གྱིས་ཤིག །
en: Bhadra, please grant us permission to also make offerings to the Tathāgata, by displaying a second modest courtyard like this for the Blessed One to enjoy, to accompany yours!”

source: དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་ཤིན་ཏུ་ངོ་མཚར་དུ་གྱུར་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལ་གནང་བ་དང་། དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡོངས་སུ་ལོངས་སྤྱད་པར་བྱ་བ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ཁང་བཟངས་རྣམ་པར་རྒྱལ་བ་དང་། ཡོངས་འདུ་ས་བརྟོལ་བས་ཆེས་ཁྱད་པར་དུ་འཕགས་པའི་འཁོར་གྱི་ཁྱམས་ཞིག་མངོན་པར་སྤྲུལ་ཏེ། འཁོར་གྱི་ཁྱམས་དེས་སྒྱུ་མ་མཁན་བཟང་པོའི་བཀོད་པ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞིའི་བཀོད་པ་ཡང་མོག་མོག་པོར་བྱས་པར་གྱུར་ཏོ། །
en: Bhadra the illusionist, utterly amazed, granted permission to Śakra, ruler of the gods, whereupon Śakra, ruler of the gods, conjured an especially magnificent courtyard for the Blessed One to enjoy—larger even than the Vaijayanta Palace, the residence of the gods of the Heaven of the Thirty-Three with the Pārijāta tree of paradise—a courtyard that eclipsed those of Bhadra the illusionist and the Four Great Kings.

source: དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་འདི་སྙམ་དུ་སེམས་ཏེ། ལྷའི་བུ་འདི་ལྟ་བུ་འདི་དག་ཀྱང་བཅོམ་ལྡན་འདས་ལ་རིམ་གྲོ་བྱ་བ་དང་། མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་མངོན་པར་བརྩོན་ཏེ་ལྷགས་པ་དང་སྦྱར་ན།
en: Then Bhadra the illusionist thought, “If even gods such as these gather with such enthusiasm to make offerings and serve the Blessed One, he must be no ordinary being.

source: སེམས་ཅན་འདི་ནི་ཐ་མལ་པ་མ་ཡིན་པས་བདག་གིས་སེམས་ཅན་མཆོག་དེ་ལྟ་བུ་ལ་ཐོ་བཙམས་པར་གྱུར་ན་མི་རུང་གིས་བྱ་བ་འདི་ལྟ་བུ་འདི་དག་དོར་གོར་མ་ཆག་སྙམ་མོ། །
en: It would not be appropriate to harm such an exalted being! Without a doubt, I must dispel my creation!”

source: དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་སྤྲུལ་པའི་བྱ་བ་དེ་དག་འདོར་བར་བྱེད།
en: Then Bhadra the illusionist attempted to dispel his conjurations and make them disappear.

source: དེ་དག་མེད་པར་བྱེད་དེ། གསང་སྔགས་དང་རིག་སྔགས་ཀྱི་སྟོབས་བསྐྱེད་པ་ཐམས་ཅད་ཀྱིས་མེད་པར་བྱེད་ཅིང་མི་སྣང་བར་བྱ་བར་བརྒལ་ཀྱང་ཞལ་ཟས་དང་། རིམ་གྲོ་བ་དང་། འཁོར་གྱི་ཁྱམས་ཀྱི་བཀོད་པ་དང་། སེང་གེའི་ཁྲི་ཡང་དེ་ཁོ་ན་བཞིན་དུ་སྣང་སྟེ།
en: Invoking the power of all his secret mantras and vidyā mantras, he tried to get rid of them and make them disappear, but the fine dishes, the attendants, the courtyard, and the lion thrones all remained, appearing just as they had before.

source: གསང་སྔགས་དང་། རིག་སྔགས་ཀྱི་སྟོབས་བསྐྱེད་པ་ཐམས་ཅད་ཀྱིས་མེད་པར་བྱ་མ་ནུས་པ་དང་།
en: He was not able to dispel them, even with all his secret mantras and vidyā mantras.

source: དེ་ཤིན་ཏུ་ངོ་མཚར་དུ་གྱུར་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་སྔོན་ཆད་ནི་འདོད་ན་སྒྱུ་མ་སྟོན་པར་ཡང་བྱེད། འདོད་ན་སྒྱུ་མ་མེད་པར་ཡང་བྱེད་ན། ད་ནི་དེ་བཞིན་གཤེགས་པའི་ཆེད་དུ་གནས་ཀྱི་བཀོད་པ་བྱས་པ་མེད་པར་བྱེད་མ་ནུས་སོ་སྙམ་མོ། །
en: Completely amazed, he thought, “Up until now I could create illusions at will and make them vanish at will, but now I am unable to dispel this array made for the Tathāgata.”

source: དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སྒྱུ་མ་མཁན་བཟང་པོའི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཟང་པོ་ཇི་ལྟར་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་ཕྱིར་གནས་ཀྱི་བཀོད་པ་བྱས་པ་འདི་མེད་པར་བྱ་མི་ནུས་པ་དེ་བཞིན་དུ་བཟང་པོ་གང་དག་དེ་བཞིན་གཤེགས་པ་ལ་སེམས་བསྐྱེད་པ་འགའ་ཙམ་ཐོབ་པ་དེ་དག་གི་སེམས་བསྐྱེད་པ་དེ་ཡང་མེད་པར་མི་འགྱུར་ཏེ། དེ་དག་གི་དེ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་གྱི་རྒྱུར་འགྱུར་རོ། །
en: Then Śakra, ruler of the gods, knowing fully what Bhadra the illusionist was thinking, said to him, “Bhadra, just as you are unable to dispel what you have created for the Tathāgata, so it is, Bhadra, for those who are able to generate even a few thoughts of the Tathāgata—their thoughts do not go away but remain a causal factor right up until their final nirvāṇa.”

source: དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་དགའ་མགུ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ཞིང་ཡིད་བདེ་བར་གྱུར་ནས་དེ་ཉིད་ཀྱི་མཚན་མོ་འདས་པ་དང་།
en: Bhadra the illusionist was utterly delighted, and rejoicing, he became thoroughly overjoyed and blissful.

source: བཅོམ་ལྡན་འདས་ལ་གདུགས་ཚོད་ལ་བབ་པ་སྐུལ་བར་བྱེད་དེ། བཅོམ་ལྡན་འདས་གདུགས་ཚོད་ལགས་པའི་དུས་དང་ཚོད་ལ་བབ་ན་ད་གདུགས་ཚོད་ལ་བབ་པར་དགོངས་སུ་གསོལ་ཞེས་གསོལ་ཏོ། །
en: So, that night passed with him urging the Blessed One to come for the midday meal, beseeching him, “Blessed One, when the midday meal in the middle of the day has arrived, please do kindly come for the midday meal!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་ཤམ་ཐབས་མནབས། ཆོས་གོས་གསོལ། ལྷུང་བཟེད་ཐོགས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་ཅིང་དགེ་སློང་གི་དགེ་འདུན་གྱི་དང་ལ་གཤེགས་ཏེ། རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་གཤེགས་ནས།
en: Early the next morning, the Blessed One donned his lower and upper robes, took up his offering bowl, gathered the saṅgha of monks, and, leading the saṅgha of monks, went to the great city of Rājagṛha, to the site of Bhadra the illusionist’s great courtyard.

source: སྒྱུ་མ་མཁན་བཟང་པོའི་འཁོར་གྱི་ཁྱམས་ག་ལ་བ་དེར་གཤེགས་ཏེ། གང་གིས་ན་སྒྱུ་མ་མཁན་བཟང་པོ་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་བདག་གིས་སྤྲུལ་པའི་བཀོད་པ་ན་བཞུགས་སོ་སྙམ་དུ་ཤེས། རྒྱལ་པོ་ཆེན་པོ་བཞི་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་བདག་ཅག་གིས་སྤྲུལ་པའི་བཀོད་པ་ན་བཞུགས་སོ་སྙམ་དུ་ཤེས། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་བདག་གིས་སྤྲུལ་པའི་བཀོད་པ་ན་བཞུགས་སོ་སྙམ་དུ་ཤེས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དོ། །
en: He then manifested a magical display such that Bhadra the illusionist was convinced that “the Tathāgata is seated at the array I have conjured,” the Four Great Kings were convinced that “the Tathāgata is seated at the array we have conjured,” and Śakra, ruler of the gods, was convinced that “the Tathāgata is seated at the array I have conjured.”

source: རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་དེ་ན་གཞན་མུ་སྟེགས་ཅན་དང་། སྤྱོད་པ་བ་དང་། ཀུན་ཏུ་རྒྱུ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་གང་དག་གིས་ཐོས་པ་དེ་དག་ནི་ངོ་མཚར་དུ་གྱུར་ནས་འཁོར་གྱི་ཁྱམས་དེར་དོང་སྟེ།
en: In the great city of Rājagṛha, word spread to others—non-Buddhists, carakas, parivrājakas, brahmins, and householders.

source: དེ་རིང་དགེ་སྦྱོང་གཽ་ཏམ་ལམ་ཐོ་འཚམ་པ་བལྟ་བར་བྱའོ་སྙམ་མོ། །
en: Amazed, they rushed to the courtyard thinking, “Today the renunciant Gautama will be put to the test!”

source: རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་དེ་ན་དད་པའི་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་གང་དག་འཁོད་པ་དེ་དག་ནི་འཁོར་གྱི་དཀྱིལ་འཁོར་དེར་དོང་ནས་དེ་རིང་དེ་བཞིན་གཤེགས་པ་ལ་བགམ་པ་ཡང་མཉན་པར་བྱ། ཆོ་འཕྲུལ་ཆེན་པོ་ཡང་བལྟ་བར་བྱའོ་སྙམ་མོ། །
en: The faithful living in the great city of Rājagṛha—monks and nuns, laymen and laywomen—likewise rushed to the gathered assembly thinking, “Today we will listen to the Tathāgata’s words, and we will also see a great miraculous display.”

source: དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོས་ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། ཁེངས་པ་ངེས་པར་བཅོམ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྣམ་པར་ཐོ་བཙམ་པའི་བསམ་པ་ཆེན་པོས་དེ་བཞིན་གཤེགས་པ་འདིར་གཤེགས་སུ་གསོལ་བ་གང་ལགས་པའི་ནོངས་པ་འཆགས་སོ། །
en: Then Bhadra the illusionist, truly overcoming his pride, haughtiness, and arrogance, bowed his head to the feet of the Blessed One and said, “Blessed One, I confess my wrongdoing—I invited the Tathāgata to come here with severely harmful intent.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་ཞལ་ཟས་སྤྲུལ་པ་དང་། རིམ་གྲོ་བགྱིད་པ་སྤྲུལ་པ་དང་། སེང་གེའི་ཁྲི་སྤྲུལ་པ་དང་།
en: But then, Blessed One, I thought that it would be wrong to deceive such an exalted being by conjuring fine dishes, servants, lion thrones, and this courtyard.

source: འཁོར་གྱི་ཁྱམས་སྤྲུལ་པ་དེ་ལ་བདག་འདི་སྙམ་དུ་སེམས་ཅན་མཆོག་དེ་ལྟ་བུ་དེ་ལ་བསླུས་པར་གྱུར་ན་མི་རུང་གིས་བྱ་བ་འདི་མ་མཆིས་པར་བགྱི་སྙམ་སྟེ་ཤིན་ཏུ་སྤངས་ཀྱང་མ་མཆིས་པར་མ་བཏུབ།
en: Realizing that this should not be done, I tried to dispel them but was unable to do so.

source: གསང་སྔགས་དང་རིག་སྔགས་ཀྱི་སྟོབས་བསྐྱེད་པ་ཐམས་ཅད་ཀྱིས་ཀྱང་མ་མཆིས་པར་བགྱི་རྔོ་མ་ཐོག་ནས་ཞལ་ཟས་དང་། རིམ་གྲོ་བགྱིད་པ་དང་།
en: Even by invoking the full force of all my secret mantras and vidyā mantras, I could not make them go away.

source: སེང་གེའི་ཁྲི་དང་། འཁོར་གྱི་ཁྱམས་ཀྱི་བཀོད་པ་ཡང་དེ་ཁོ་ན་བཞིན་དུ་གདའོ། །
en: It was no use, and all these fine dishes, servants, lion thrones, and courtyard arrangements remained just as they were.”

source: དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བཟང་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་སྤྱད་པ་དང་། ཡོངས་སུ་སྤྱད་པ་ཡང་འདི་ལྟ་སྟེ། ལས་ཀྱི་སྒྱུ་མས་སྤྲུལ་པ་ཡིན་ནོ། །
en: The Blessed One then said to Bhadra the illusionist, “Bhadra, the amenities and enjoyments of all beings are also like this, illusory conjurations of karma.

source: བཟང་པོ་དགེ་སློང་གི་དགེ་འདུན་འདི་ཡང་འདི་ལྟ་སྟེ། ཆོས་ཀྱི་སྒྱུ་མས་སྤྲུལ་པ་ཡིན་ནོ། །
en: Bhadra, this saṅgha of monks is also like this, an illusory conjuration of the Dharma.

source: བཟང་པོ་ང་ཡང་འདི་ལྟ་སྟེ། ཡེ་ཤེས་ཀྱི་སྒྱུ་མས་སྤྲུལ་པ་ཡིན་ནོ། །
en: Bhadra, I, too, am also like this, an illusory conjuration of wisdom.

source: བཟང་པོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་འདི་ལྟ་སྟེ། སྣ་ཚོགས་མངོན་པར་འགྲུབ་པར་བྱེད་པའི་སྒྱུ་མས་སྤྲུལ་པ་ཡིན་ནོ། །
en: Bhadra, this entire trichiliocosm is also like this, the illusory conjuration of various manifest formations.

source: བཟང་པོ་ཆོས་ཐམས་ཅད་ཀྱང་འདི་ལྟ་སྟེ། རྐྱེན་ཚོགས་པའི་སྒྱུ་མས་སྤྲུལ་པ་ཡིན་ནོ། །
en: Indeed Bhadra, all phenomena are like this, the illusory conjurations of masses of conditions.

source: བཟང་པོ་འོན་ཀྱང་ད་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་ཇི་ལྟར་སྤྲུལ་པའི་བཟའ་བ་དང་། བཅའ་བ་དང་། མྱང་བ་དང་། བལྡག་པ་དག་ཁྱོད་ཀྱིས་ཕུལ་ཅིག །དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོས་སྤྲུལ་པའི་རིམ་གྲོ་བ་དེ་དག་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དག་དང་།
en: “Nevertheless, Bhadra, when you know the time is right, you may offer these dishes and drinks, delectables and nectars, however they have been conjured.”

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འཁོར་དང་བཅས་པ་དང་ལྷན་ཅིག་སྤྲུལ་པའི་བཟའ་བ་དང་། བཅའ་བ་དང་། མྱང་བ་དང་། བལྡག་པ་དེས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ཡང་དག་པར་ཚིམ་པར་བྱེད་དོ། །
en: Then the servants conjured by Bhadra and the Four Great Kings and Śakra, ruler of the gods, along with his retinue, satisfied the Blessed One and the saṅgha of monks with the conjured dishes and drinks, delectables, and nectars.

source: དེ་ནས་དེའི་ཚེ་གནས་བརྟན་འོད་སྲུང་ཆེན་པོས་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །སྦྱིན་པ་འདི་ནི་ཅི་འདྲ་དང་། །ལེན་པར་བྱེད་པ་ཅི་འདྲ་བ། །དེ་འདྲའི་ཆོས་ཉིད་ཐོབ་འགྱུར་བར། །
en: Then the elder Mahākāśyapa spoke the following verse: “As is the gift, So is the recipient.

source: ཡོན་ནི་རྣམ་པར་སྦྱོང་གྱུར་ཅིག །
en: Arriving at the true nature of both as just so, May the offering be perfectly purified.”

source: མཽད་གལ་གྱི་བུ་ཆེན་པོས་སྨྲས་པ། །གདན་ནི་ཇི་ལྟར་བཤམས་པ་དང་། །དེ་ལ་གང་དག་བཞུགས་པ་རྣམས། །མི་མཉམ་མ་མཆིས་མཚུངས་པ་སྟེ། །
en: Mahāmaudgalyāyana said: “As for the seating arrangements And those who are seated, There is no distinction to be found; they are the same.

source: མཆོད་སྦྱིན་དགེ་བ་བླ་ན་མེད། །
en: Thus the virtue of this offering is unsurpassed.”

source: ཤཱ་རིའི་བུས་སྨྲས་པ། རིམ་གྲོ་བྱེད་པའི་སེམས་གང་དང་། །ལེན་པར་བྱེད་པའི་སེམས་གང་དང་། །
en: Śāriputra said: “As the mind of the one who serves, So is the mind of the one who receives.

source: སྦྱིན་པར་བྱེད་པ་ཇི་ལྟ་བར། །ཡོན་ནི་མྱུར་དུ་སྦྱོང་བར་ཤོག །
en: With this way of giving, May the offering be swiftly purified!”

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། གཏོང་མེད་སྦྱིན་པ་འདི་བཏང་བ། །ལེན་པ་མེད་པ་རྣམས་ཀྱིས་བླངས། །
en: Subhūti said: “The gift was given without a giver And received without a receiver.

source: གང་དག་འདིར་ནི་གཤེགས་པ་རྣམས། །དེ་དག་ཡོན་སྦྱོང་བྱེད་པ་ཡིན། །
en: Thus, whosoever has come here Purifies the offering.”

source: ཀུན་དགའ་བོས་སྨྲས་པ། འདི་ནི་ནམ་མཁའི་སྦྱིན་པ་སྟེ། །བསམ་གྱིས་མི་ཁྱབ་རྣམས་ཀྱིས་སྤྱད། །
en: Ānanda said: “These gifts, as endless as the sky, Are enjoyed by inconceivably numerous beings.

source: གང་དག་སེམས་ལུས་གྲོལ་བ་དེ། །འཇིག་རྟེན་དག་ན་ཡོན་སྦྱོང་མཆོག །
en: But it is their liberation of mind and body That is the greatest pure offering in all the worlds.”

source: བྱང་ཆུབ་སེམས་དཔའ་འོད་ཏོག་གིས་སྨྲས་པ། ཇི་ལྟ་བུར་ན་སྒྱུ་མའི་མཁན། །བཟང་པོས་བཀོད་པ་སྤྲུལ་བྱས་པ། །དངོས་ཀུན་དེ་དང་འདྲ་བ་སྟེ། །བྱིས་པས་དེ་ནི་མི་རྟོགས་སོ། །
en: The bodhisattva Pinnacle of Light said: “Like the array conjured up By Bhadra the illusionist, So are all material things, But the foolish do not realize this.”

source: བྱང་ཆུབ་སེམས་དཔའ་འོད་བཀོད་པས་སྨྲས་པ། ཇི་ལྟར་གདན་དང་ལྗོན་ཤིང་དག །དུ་མ་མངོན་པར་སྤྲུལ་བྱས་པ། །ཡིད་ཀྱི་སྒྱུ་མ་ལྟ་བུར་སྟོང་། །
en: The bodhisattva Prabhāvyūha said: “Like these seats and trees, So are all manifold phenomena conjured, Like mind’s illusion—empty.

source: འདི་ལ་ཁྱད་པར་འགའ་ཡང་མེད། །
en: There is not the slightest difference.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེང་གེས་སྨྲས་པ། སེང་གེའི་སྒྲ་ནི་མ་ཐོས་ན། །ཝ་ནི་ནགས་ཚལ་ནང་ན་སྒྲོགས། །
en: The bodhisattva Siṃha said: “So long as the lion’s roar is not heard, The jackals howl in the forest.

source: དེ་ཡིས་སེང་གེའི་སྒྲ་ཐོས་ནས། །ཕྱོགས་བཅུ་དག་ཏུ་འབྲོས་པར་འགྱུར། །
en: But hearing the lion’s roar, They flee in the ten directions.

source: དེ་བཞིན་སྒྱུ་མཁན་བཟང་པོ་ཡང་། །དེ་བཞིན་གཤེགས་པ་མ་མཐོང་ན། །མུ་སྟེགས་ནང་དུ་རྒྱལ་བ་བས། །བདག་ཉིད་མཆོག་ཅེས་སྒྲོགས་པར་བྱེད། །
en: “Similarly, so long as Bhadra the illusionist Did not see the Tathāgata, He proclaimed among the non-Buddhists, ‘I am superior to the Victorious One!’

source: བཟང་པོ་དེ་བཞིན་གཤེགས་པ་ཡི། །སྒྱུ་མས་སྒྱུ་མར་རྟོགས་བྱེད་པ། །
en: “Bhadra, the Tathāgata’s illusion Shows what illusion really is.

source: ཚད་མར་གྱུར་པ་གསུངས་ནས་ནི། །དེ་ལ་བདུད་ཀྱི་གཏིང་མི་དཔོགས།
en: Should this illusion be taught to its full extent, Even Māra could not fathom its depths.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་བློ་གྲོས་ཀྱིས་སྨྲས་པ། ཞལ་ཟས་འདི་ནི་སྤྲུལ་པ་སྟེ། །བསྙེན་བཀུར་བྱེད་པའང་སྤྲུལ་པ་ཡིན། །སྤྱོད་པར་བྱེད་པའང་སྤྲུལ་པ་སྟེ། །
en: The bodhisattva Siṃhamati said: “These fine dishes are conjurations, As are these attendants offering service; Even the ones enjoying it are conjurations.

source: སྦྱིན་པ་དགེ་བ་བླ་ན་མེད། །
en: Thus the virtue of this gift is unsurpassed.”

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་སྨྲས་པ། མེ་ནི་མར་དང་ཏིལ་མར་གྱིས། །ཕྱི་ཕྱིར་ཞིང་ནི་རབ་ཏུ་མཆེད། །
en: The bodhisattva Maitreya said: “A flame fed with ghee and sesame oil Flares and swells ever more fiercely.

source: དེ་བཞིན་བཟང་པོའི་སྒྱུ་མ་ཡིས། །སངས་རྒྱས་སྒྱུ་མ་ངེས་པར་བསྟན། །
en: Just so, by means of Bhadra’s power of illusion, The Buddha’s power of illusion is definitively taught.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་སྨྲས་པ། །ཇི་ལྟར་འདི་ནི་སྔོན་གནས་པ། །ཐམས་ཅད་བྱེད་པ་མེད་པ་ལྟར། །དེ་བཞིན་ཆོས་རྣམས་ཐམས་ཅད་ནི། །སྔོན་གྱི་མཐའ་ནས་རྟག་ཏུ་མཉམ། །
en: Mañjuśrīkumārabhūta said: “Just as what was here before, Like what he created, does not exist, All phenomena, from the very beginning, Have always been the same.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྒྱུ་མ་མཁན་བཟང་པོ་ཤིན་ཏུ་གདུལ་བའི་དབང་དུ་མཛད་ནས་ཁྱིམ་བདག་ཅིག་སྤྲུལ་ཏེ། འཁོར་གྱི་ཁྱམས་དེའི་ནང་དུ་ཞུགས་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཟང་པོ་ཅི་བྱེད་སྨྲས་པ།
en: Then the Blessed One, using his powers to thoroughly tame Bhadra the illusionist, conjured a householder, who came into the courtyard and asked Bhadra the illusionist, “Bhadra, what are you doing?”

source: དགེ་སྦྱོང་གཽ་ཏ་མ་འདི་གདུགས་ཚོད་གསོལ་བར་བྱེད་དོ། །
en: “I am offering the midday meal to the renunciant Gautama,” Bhadra replied.

source: དེས་སྨྲས་པ།
en: “Forget it, Bhadra!

source: བཟང་པོ་ཐོང་དེ་སྐད་མ་ཟེར།
en: Do not say that!

source: དེ་བཞིན་གཤེགས་པ་དེ་ནི་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ཁབ་ན་གདུགས་ཚོད་གསོལ་ཞིང་བཞུགས་སོ། །
en: The Tathāgata, with his saṅgha of monks, is receiving the midday meal at King Ajātaśatru’s court.”

source: སྒྱུ་མ་མཁན་བཟང་པོས་ཀྱང་སངས་རྒྱས་ཀྱི་མཐུས་དེ་བཞིན་གཤེགས་པ་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ཁབ་ན་གདུགས་ཚོད་གསོལ་བར་མཐོང་ངོ་། །
en: Then, through the power of the Buddha, Bhadra the illusionist saw the Tathāgata, with the saṅgha of monks, receiving the midday meal at King Ajātaśatru’s court.

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་གཉིས་པ་ཞིག་མངོན་པར་སྤྲུལ་ནས་དེ་ནང་དུ་ཞུགས་ཏེ། སྒྱུ་མ་མཁན་བཟང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཟང་པོ་ཅི་བྱེད་སྨྲས་པ།
en: The Blessed One then conjured a second householder, who came into the courtyard and asked Bhadra the illusionist, “Bhadra, what are you doing?”

source: ཐོང་དེ་སྐད་མ་ཟེར།
en: Do not say that!

source: དེ་བཞིན་གཤེགས་པ་དེ་ནི་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ཀུན་ཏུ་རྒྱུའི་སྲང་ན་བསོད་སྙོམས་ཀྱི་ཕྱིར་རྒྱུ་ཞིང་བཞུགས་སོ། །
en: The Tathāgata, with his saṅgha of monks, is on the parivrājaka street collecting alms.”

source: སྒྱུ་མ་མཁན་བཟང་པོས་ཀྱང་། སངས་རྒྱས་ཀྱི་མཐུས་དེ་བཞིན་གཤེགས་པ་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ཀུན་ཏུ་རྒྱུའི་སྲང་ན་བསོད་སྙོམས་ཀྱི་ཕྱིར་རྒྱུ་བར་མཐོང་ངོ་། །
en: Then, through the power of the Buddha, Bhadra the illusionist saw the Tathāgata, with the saṅgha of monks, collecting alms on the parivrājaka street.

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་གཞན་ཞིག་སྤྲུལ་ཏེ། དེ་ནང་དུ་ཞུགས་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཟང་པོ་ཅི་བྱེད། སྨྲས་པ།
en: The Blessed One then conjured another householder, who came into the courtyard and asked Bhadra the illusionist, “Bhadra, what are you doing?”

source: དེ་བཞིན་གཤེགས་པ་ནི་གདུགས་ཚོད་གསོལ་བར་བྱེད་དོ། །
en: “I am offering the midday meal to the renunciant Gautama,” Bhadra replied.

source: དེ་བཞིན་གཤེགས་པ་དེ་ནི་འཚོ་བྱེད་ཀྱི་སྐྱེད་མོས་ཚལ་ན་འཁོར་བཞི་ལ་ཆོས་སྟོན་ཅིང་བཞུགས་སོ། །
en: The Tathāgata is in the physician’s grove teaching the Dharma to the fourfold retinue.”

source: སྒྱུ་མ་མཁན་བཟང་པོས་ཀྱང་སངས་རྒྱས་ཀྱི་མཐུས་དེ་བཞིན་གཤེགས་པ་འཚོ་བྱེད་ཀྱི་སྐྱེད་མོས་ཚལ་ན་འཁོར་བཞི་ལ་ཆོས་སྟོན་པར་མཐོང་ངོ་། །
en: Then, through the power of the Buddha, Bhadra the illusionist saw the Tathāgata in the physician’s grove teaching the Dharma to the fourfold retinue.

source: དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་སྒྱུ་མ་མཁན་བཟང་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་སྒྱུ་མ་མཁན་བཟང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཟང་པོ་ཅི་བྱེད། སྨྲས་པ།
en: Śakra, ruler of the gods, then approached Bhadra the illusionist and asked, “Bhadra, what are you doing?”

source: དེ་བཞིན་གཤེགས་པ་དེ་ནི་སུམ་ཅུ་རྩ་གསུམ་པའི་གནས་ན་ཤིང་ཡོངས་འདུའི་དྲུང་ན་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ལ་ཆོས་སྟོན་ཅིང་བཞུགས་སོ། །
en: The Tathāgata is in the Heaven of the Thirty-Three, in front of the Pārijāta tree, teaching the Dharma to the gods of the Thirty-Three.”

source: བཟང་པོས་ཀྱང་དེ་བཞིན་གཤེགས་པ་སུམ་ཅུ་རྩ་གསུམ་པའི་གནས་ན་ཤིང་ཡོངས་འདུའི་དྲུང་ན་ཆོས་སྟོན་པར་མཐོང་ངོ་། །
en: Then Bhadra also saw the Tathāgata in the Heaven of the Thirty-Three, teaching the Dharma in front of the Pārijāta tree.

source: དེ་ནས་སྒྱུ་མ་མཁན་བཟང་པོས་ཤིང་ལྗོན་པ་སྤྲུལ་པ་ཇི་སྙེད་པ་དེ་ཐམས་ཅད་ཀྱི་ལོ་མ་ཐམས་ཅད་དང་། མེ་ཏོག་ཐམས་ཅད་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཚན་གྱིས་བརྒྱན་པ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ངོ་། །
en: Then on all the leaves and all the flowers on every tree that Bhadra the illusionist had conjured, Bhadra the illusionist saw the Tathāgata, adorned with the marks of a great being and encircled by the saṅgha of monks.

source: སྒྱུ་མ་མཁན་བཟང་པོས་སེང་གེའི་ཁྲི་སྤྲུལ་པ་གང་དག་ཡིན་པ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞིས་སེང་གེའི་ཁྲི་སྤྲུལ་པ་གང་དག་ཡིན་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཚན་གྱིས་བརྒྱན་པ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་བ་མཐོང་ངོ་། །
en: On each of the lion thrones that he had conjured and on the lion thrones that the Four Great Kings had conjured, he saw the Tathāgata, adorned with the marks of a great being and encircled by the saṅgha of monks.

source: རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན་རྩིག་པའམ། ཁྱིམ་མམ། ཁང་བཟངས་སམ། སྲང་ངམ། ལམ་པོ་ཆེ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ན་ཡང་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཚན་གྱིས་བརྒྱན་པ་མཐོང་ངོ་། །
en: Everywhere in the great city of Rājagṛha, in every building, house, and palace, on every path and road, he saw the Tathāgata, adorned with the marks of a great being.
